Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/third_level_education/colleges_and_qualifications/third_level_education_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Third-level education in Ireland
ga: Oideachas Tríú Leibhéil in Éirinn

source: A wide range of institutions in Ireland provide third-level education
ga: Tá raon leathan institiúidí ann in Éirinn a chuireann oideachas tríú leibhéal ar fáil

source: The university sector, the technological sector and the colleges of education are substantially funded by the State
ga: Maoiníonn an Stát earnáil na n-ollscoileanna, an earnáil teicneolaíochta agus na coláistí oideachais go substaintiúil

source: In addition, there are a number of independent private colleges
ga: Ina theannta sin tá roinnt coláistí príobháideacha neamhspleácha ann

source: The Higher Education Authority is the statutory agency responsible for the funding of universities, institutes of technology and certain other higher education institutions
ga: Is é an tÚdarás um Ard-Oideachas an ghníomhaireacht reachtúil atá freagrach as maoiniú na n-ollscoileanna, na bhforas teicneolaíochta agus roinnt institiúidí ardoideachais eile

source: It has an advisory role in relation to the whole sector of third-level education
ga: Tá ról comhairleach aige maidir le hiomlán na earnála oideachais tríú leibhéal

source: Universities in Ireland are State-funded, but they are generally autonomous
ga: Is é an Stát a mhaoiníonn na hollscoileanna in Éirinn ach de ghnáth tá siad féinlathach

source: There are 7 universities in Ireland
ga: Tá 7 n-ollscoil ann

source: • The National University of Ireland (NUI) which is the umbrella university covering University College Dublin (UCD), National University of Ireland, Galway, University College Cork, and National University of Ireland, Maynooth
ga: • Ollscoil Náisiúnta na hÉireann, arb éard atá inti brat-ollscoil a chumhdaíonn An Coláiste Ollscoile, Baile Átha Cliath (UCD), An Coláiste Ollscoile Gaillimh (UCG), Coláiste na hOllscoile, Corcaigh (UCC), agus Coláiste Phádraig i Maigh Nuad

source: • The University of Dublin, which is generally known as Trinity College Dublin (TCD)
ga: • Ollscoil Bhaile Átha Cliath, ar a dtugtar Coláiste na Tríonóide Baile Átha Cliath (TCD) de ghnáth

source: • Dublin City University (DCU)
ga: • Ollscoil Chathair Bhaile Átha Cliath (DCU)

source: The technological sector includes institutes of technology which provide programmes of education and training in areas such as business, science, engineering, linguistics and music to certificate, diploma and degree levels
ga: San earnáil teicneolaíochta tá na forais teicneolaíochta a chuireann cláir oideachais agus oiliúna ar fáil i réimsí mar ghnó, eolaíocht, innealtóireacht, theangeolaíocht agus ceol chomh hard leis na leibhéil teastais, dioplóma agus céime

source: There are 14 institutes of technology located around the country
ga: Tá 14 fhoras teicneolaíochta suite ar fud an tíre

source: In the Dublin area they are Dublin, Tallaght, Blanchardstown and Dun Laoghaire
ga: I gceantar Bhaile Átha Cliath tá siad i mBaile Átha Cliath féin, i dTamhlacht, i mBaile Bhlainséir agus i nDún Laoghaire

source: Outside Dublin they are Cork, Waterford, Tralee, Dundalk, Athlone, Galway and Mayo, Sligo, Letterkenny, Limerick, and Carlow
ga: Sa chuid eile den tír tá siad i gCorcaigh, i bPort Láirge, i dTrá Lí, i nDún Dealgan, i mBaile Átha Luain, i nGaillimh agus Maigh Eo, i Sligeach, i Leitir Ceanainn, i Luimneach agus i gCeatharlach

source: Several colleges of education in Ireland provide specialised training for primary school teachers
ga: Tá roinnt mhaith coláistí oideachais a chuireann sainoiliúint ar fáil do mhúinteoirí bunscoile

source: They offer a 3-year Bachelor of Education degree and an 18-month postgraduate diploma
ga: Tairgeann siad céim trí bliana Baitsiléara Oideachais agus dioplóma 18 mí iarchéime

source: Post-primary teachers generally do a primary degree, followed by a postgraduate diploma
ga: De ghnáth déanann múinteoirí iar-bhunscoile bunchéim agus dioplóma iarchéime ina dhiaidh sin

source: You can find more information in our document on teacher qualifications
ga: Tá tuilleadh faisnéise le fáil inár ndoiciméad faoi cháilíochtaí múinteora

source: In addition to State-funded colleges, a number of fee-paying third-level educational institutions offer courses, mainly in professional vocational training and business
ga: Le cois na gcoláistí a mhaoiníonn an Stát, tá roinnt institiúidí oideachais tríú leibhéil ar tháille ann a chuireann cúrsaí ar fáil, go mór mór san oiliúint ghairmiúil phroifisiúnta agus sa ghnó

source: Some of these colleges are linked to universities or professional associations and their qualifications may be accredited accordingly – see below
ga: Tá cuid de na coláistí seo nasctha leis na hollscoileanna nó le comhlachais ghairmiúla agus féadfar a gcuid cáilíochtaí a chreidiúnú dá réir– féach anseo thíos

source: The National Framework of Qualifications (NFQ) is a system of 10 levels which allows the different standards and levels qualifications to be compared
ga: An Creat Náisiúnta Cáilíochtaí (CNC): Córas 10 leibhéal é seo ar féidir dá bharr caighdeáin agus leibhéil na gcáilíochtaí a chur i gcomórtas le chéile

source: A diagram of the NFQ is on the website of the Quality and Qualifications Ireland (QQI)
ga: Tá léaráid den CNC ar láithreán gréasáin Dearbhú Cáilíochta agus Cáilíochtaí Éireann (DCCE)

source: Third-level qualifications are Levels 6-10 in the Framework
ga: Tá na cáilíochtaí tríú leibhéal ar Leibhéil 6-10 sa Chreat

source: In the university sector the 4 awarding bodies are the National University of Ireland (UCD, UCC, UCG and Maynooth), Dublin University, Dublin City University and the University of Limerick
ga: In earnáil na n-ollscoileanna is iad Ollscoil Náisiúnta na hÉireann (UCD, UCC, UCG agus Maigh Nuad), Ollscoil Bhaile Átha Cliath, Ollscoil Chathair Bhaile Átha Cliath agus Ollscoil Luimnigh na 4 fhoras cáiliúcháin

source: Quality and Qualifications Ireland is the awarding body for third-level educational institutions outside the university sector
ga: Is í Dearbhú Cáilíochta agus Cáilíochtaí Éireann an foras cáiliúcháin d’institiúidí oideachais tríú leibhéil lasmuigh d’earnáil na n-ollscoileanna

source: QQI is also the awarding body for further education and training
ga: Is í DCCE an foras cáiliúcháin don bhreisoideachas agus don oiliúint in Éirinn

source: It also awards Higher Certificates (NFQ Level 6)
ga: Bronnann sí Ardteastais freisin (Leibhéal 6)

source: More detailed information is in our document on further and higher education qualifications
ga: Is féidir faisnéis níos mionsonraithe a fháil inár ndoiciméad faoi cháilíochtaí breisoideachais agus ardoideachais

source: Universities: The State-supported universities all award their own degrees and other awards
ga: Na hollscoileanna: Bronnann na hollscoileanna atá ann cheana agus atá arna maoiniú ag an Stát a gcuid céimeanna féin agus cáilíochtaí eile

source: University students qualify with Ordinary Bachelors degrees (NFQ Level 7) or Honours Bachelors degrees (NFQ Level 8)
ga: Cáilíonn mic léinn ollscoile le Gnáthchéim Bhaitsiléara (Leibhéal 7 CNC) nó le Céim Onóracha Bhaitsiléara (Leibhéal 8 CNC)

source: Universities also offer Masters (NFQ Level 9) and Doctoral (NFQ Level 10) postgraduate degrees
ga: Tairgeann na hollscoileanna Céimeanna Máistir (Leibhéal 9 CNC) agus Dochtúra (Leibhéal 10 CNC) iar-bhunchéime freisin

source: Institutes of technology (ITs): The Dublin Institute of Technology (DIT) makes its own awards
ga: Institiúidí teicneolaíochta: Bronnann Institiúid Teicneolaíochta Bhaile Átha Cliath (DIT) a cuid cáilíochtaí féin

source: The other institutes of technology grant degrees, diplomas and certificates, which are validated by QQI
ga: Bronnann na hinstitiúidí teicneolaíochta eile céimeanna, dioplómaí agus teastais a dheimhníonn DCCE

source: Students generally qualify with Higher Certificates (NFQ Level 6) or Ordinary Bachelors degrees (NFQ Level 7)
ga: De ghnáth cáilíonn na mic léinn le hArdteastas (Leibhéal 6 CNC) nó le Gnáthchéim Bhaitsiléara (Leibhéal 7 CNC)

source: Honours Bachelors degrees (NFQ Level 8), Postgraduate Diplomas (NFQ Level 9) and Higher Doctorate (NFQ Level 10) are also available
ga: Bíonn Céimeanna Baitsiléara le hOnóracha (Leibhéal 8 CNC), Dioplómaí Iarchéime (Leibhéal 9 CNC) agus Ard-Dochtúireachtaí (Leibhéal 10 CNC) le fáil freisin

source: Other colleges: The other State-supported colleges generally grant awards that are validated by QQI
ga: Coláistí eile: De ghnáth bronnann na coláistí eile a fhaigheann maoiniú ón Stát cáilíochtaí a dheimhníonn DCCE

source: The private colleges make awards, some of which are validated by foreign universities and some of which are validated by QQI
ga: Bronnann na coláistí príobháideacha cáilíochtaí a ndeimhníonn ollscoileanna thar lear cuid díobh agus a ndeimhníonn DCCE cuid eile díobh

source: Some of their awards are not validated by any outside body
ga: Ní dheimhníonn aon chomhlacht seachtrach cuid de na cáilíochtaí a bhronnann siad

source: Progression is a feature of the National Framework of Qualifications
ga: Tá an réimniú ar cheann de ghnéithe Chreat Náisiúnta na gCáilíochtaí

source: Often a Level 6 certificate awarded by QQI can offer the opportunity to continue on to a NFQ Level 7 or Level 8 degree
ga: Go minic tugann teastas Leibhéil 6 arna bhronnadh ag DCCE an chaoi do mhac léinn leanúint ar aghaidh chun céime ar Leibhéal 7 nó Leibhéal 8

source: The Higher Education Links Scheme allows those with a QQI Level 5 and Level 6 (NFQ) qualification to progress to higher education
ga: Tugann an Scéim Nasc Ardoideachais an chaoi dóibh siúd a bhfuil cáilíochtaí DCCE Leibhéil 5 agus Leibhéil 6 (CNC) acu dul ar aghaidh chun an ardoideachais

source: You can get a leaflet about progression (pdf)
ga: Féadfaidh tú bileog faoin réimniú (pdf)

source: If you are thinking of going to college you can search the Qualifax website for details of courses
ga: Má tá tú ag brath ar dhul ar coláiste féadfaidh tú an láithreán gréasáin Qualifax a chuardach le haghaidh mionsonraí ar na cúrsaí

source: Generally, applications for undergraduate courses in Ireland are made through the Central Applications Office (CAO)
ga: De ghnáth, déantar na hiarratais ar chúrsaí fochéimí tríd an Lár-Oifig Iontrála (CAO)

source: You can find more information in our documents on application procedures and entry requirements, third-level fees and tax relief for third-level fees
ga: Féadfaidh tú a thuilleadh faisnéise a fháil inár gcuid doiciméad faoi ghnáthaimh iarratais agus riachtanais iontrála, faoi tháillí tríú leibhéal agus faoi fhaoiseamh cánach do tháillí tríú leibhéal

source: See below for information about postgraduate study
ga: Gheofar faisnéis faoin staidéar iarchéime thíos

source: If you think you might qualify for a grant, you will find information on maintenance grant schemes for students on third-level courses and grants and funds available for mature students
ga: Más dóigh leat go bhféadfadh teideal a bheith agat ar dheontas, gheobhaidh tú faisnéis i scéimeanna deontas cothaithe do mhic léinn ar chúrsaí tríú leibhéal agus deontais agus maoiniú le fáil ag mic léinn lánfhásta

source: You can find contact details for third-level education institutions on the CAO website
ga: Is féidir mionsonraí teagmhála maidir le hinstitiúidí oideachais tríú leibhéil a fháil ar láithreán gréasáin na Lár-Oifige Iontrála

source: You need to consider what kind of postgraduate study you wish to do, what are the most suitable courses for you and your career and what costs are involved
ga: Ní mór duit machnamh a dhéanamh ar an gcineál staidéir iarchéime ba mhian leat a dhéanamh, ar na cúrsaí is oiriúnaí duit agus do do shlí bheatha agus na costais ghaolmhara

source: Postgraduate study can either be a taught course or research and generally falls into one of the following categories:
ga: Is féidir le staidéar iarchéime a bheith ina chúrsa múinte nó bunaithe ar thaighde agus go ginearálta titeann sé isteach i gceann de na catagóirí seo a leanas:

source: • Postgraduate diploma: Often this is a vocational course, linked to professions such as teaching or librarianship
ga: • Dioplóma iarchéime: Is minic gur cúrsa gairmoideachais é seo, ceangailte le gairmeacha ar nós teagaisc nó leabharlannaíochta

source: The subject may be different from the primary degree
ga: Is féidir go mbeidh difríocht idir a ábhar agus ábhar na bunchéime

source: • Masters degree: This can be either a taught course or based on research
ga: • Céim mháistreachta: Is féidir leis seo a bheith ina chúrsa múinte nó bunaithe ar thaighde

source: It lasts 1-2 years and usually involves course work and a thesis
ga: Maireann sé de ghnáth 1-2 bliain agus baineann sé de ghnáth le hobair chúrsa agus tráchtas

source: • PhD: This is a doctorate awarded for a thesis based on research
ga: • PhD: Is dochtúireacht é seo a bhronntar ar thráchtas bunaithe ar thaighde

source: It takes at least 3 years' study and it must be an original contribution to knowledge
ga: Glacann sé ar a laghad 3 bliana staidéir agus ní mór dó cur leis an eolas mar ábhar nuálach

source: In general, you will have to pay fees for postgraduate courses
ga: Go ginearálta, beidh ort táillí a íoc le haghaidh cúrsaí iarchéime

source: You may be able to get tax relief on the fees
ga: Is féidir go mbeidh tú in inmhe faoiseamh cánach a fháil ar na táillí

source: If you got a third-level grant for your undergraduate course, you may qualify for a grant for postgraduate study in Ireland, including Northern Ireland
ga: Má fuair tú deontas tríú leibhéil le haghaidh do chúrsa fochéime, is féidir go mbeidh tú incháilithe le haghaidh staidéir iarchéime in Éirinn, lena n-áiritear Tuaisceart na hÉireann

source: There are different sources of funding for postgraduate students
ga: Tá foinsí éagsúla cistithe do mhic léinn iarchéime

source: Sometimes financial support is available from the university that is running the postgraduate course; sometimes you need to apply to an external body
ga: Bíonn tacaíocht airgeadais ar fáil in amanna ón ollscoil atá ag reáchtáil an chúrsa iarchéime; in amanna bíonn ort iarratas a chur isteach chuig grúpa seachtrach

source: A number of research bodies provide funding for postgraduate research in Ireland, including the Irish Research Council and Science Foundation Ireland
ga: Cuireann roinnt grúpaí taighde cistiú ar fáil le haghaidh taighde iarchéime in Éirinn, lena n-áirítear an An Chomhairle um Thaighde in Éirinn agus Fondúireacht Eolaíochta Éireann

source: A number of scholarships and fellowships for study abroad are awarded annually by foreign governments to Irish students who are engaged in, or have completed, a course of third-level education
ga: Deonaíonn rialtais eachtracha roinnt scoláireachtaí agus comhaltachtaí chun staidéar thar lear gach bliain do mhic léinn Éireannacha atá i mbun chúrsa oideachais tríú leibhéil, nó a bhfuil sé curtha i gcrích acu

source: You can find information about opportunities for postgraduate study abroad on the website of the Department of Education and Skills
ga: Is féidir leat eolas faoi dheiseanna le haghaidh staidéar iarchéime thar lear a fháil ar láithreán gréasáin na Roinne Oideachais agus Scileanna

source: If you wish to study in the UK there is a graduate website for the UK called Prospects
ga: Más mian leat staidéar sa R.A tá láithreán gréasáin don R.A ar a dtugtar Prospects

source: Applications and further information
ga: Iarratais agus eolas breise

source: For postgraduate courses you generally apply directly to the university or college
ga: Le haghaidh cúrsaí iarchéime go ginearálta cuireann tú iarratas isteach go díreach chuig an ollscoil nó chuig an coláiste

source: You can find information about postgraduate courses and applications from the careers office in your college or university
ga: Is féidir leat teacht ar eolas faoi chúrsaí iarchéime agus ar iarratais ón oifig gairmeacha i do choláiste nó ollscoil

source: If you are applying for postgraduate courses in the UK you can apply online to certain universities and colleges
ga: Má tá tú ag cur isteach ar chúrsaí iarchéime sa RA is féidir leat iarratas a dhéanamh ar líne ar ollscoileanna agus ar choláistí áirithe
